GopalSaraf/Practicals/PSDL/include/proc/pic16f17144.inc
// Register: CRCSHFTT
#define CRCSHFTT CRCSHFTT
CRCSHFTT                                 equ 01CA1h
// bitfield definitions
CRCSHFTT_SHIFT_POSN                      equ 0000h
CRCSHFTT_SHIFT_POSITION                  equ 0000h
CRCSHFTT_SHIFT_SIZE                      equ 0008h
CRCSHFTT_SHIFT_LENGTH                    equ 0008h
CRCSHFTT_SHIFT_MASK                      equ 00FFh
CRCSHFTT_SHIFT24_POSN                    equ 0000h
CRCSHFTT_SHIFT24_POSITION                equ 0000h
CRCSHFTT_SHIFT24_SIZE                    equ 0001h
CRCSHFTT_SHIFT24_LENGTH                  equ 0001h
CRCSHFTT_SHIFT24_MASK                    equ 0001h
CRCSHFTT_SHIFT25_POSN                    equ 0001h
CRCSHFTT_SHIFT25_POSITION                equ 0001h
CRCSHFTT_SHIFT25_SIZE                    equ 0001h
CRCSHFTT_SHIFT25_LENGTH                  equ 0001h
CRCSHFTT_SHIFT25_MASK                    equ 0002h
CRCSHFTT_SHIFT26_POSN                    equ 0002h
CRCSHFTT_SHIFT26_POSITION                equ 0002h
CRCSHFTT_SHIFT26_SIZE                    equ 0001h
CRCSHFTT_SHIFT26_LENGTH                  equ 0001h
CRCSHFTT_SHIFT26_MASK                    equ 0004h
CRCSHFTT_SHIFT27_POSN                    equ 0003h
CRCSHFTT_SHIFT27_POSITION                equ 0003h
CRCSHFTT_SHIFT27_SIZE                    equ 0001h
CRCSHFTT_SHIFT27_LENGTH                  equ 0001h
CRCSHFTT_SHIFT27_MASK                    equ 0008h
CRCSHFTT_SHIFT28_POSN                    equ 0004h
CRCSHFTT_SHIFT28_POSITION                equ 0004h
CRCSHFTT_SHIFT28_SIZE                    equ 0001h
CRCSHFTT_SHIFT28_LENGTH                  equ 0001h
CRCSHFTT_SHIFT28_MASK                    equ 0010h
CRCSHFTT_SHIFT29_POSN                    equ 0005h
CRCSHFTT_SHIFT29_POSITION                equ 0005h
CRCSHFTT_SHIFT29_SIZE                    equ 0001h
CRCSHFTT_SHIFT29_LENGTH                  equ 0001h
CRCSHFTT_SHIFT29_MASK                    equ 0020h
CRCSHFTT_SHIFT30_POSN                    equ 0006h
CRCSHFTT_SHIFT30_POSITION                equ 0006h
CRCSHFTT_SHIFT30_SIZE                    equ 0001h
CRCSHFTT_SHIFT30_LENGTH                  equ 0001h
CRCSHFTT_SHIFT30_MASK                    equ 0040h
CRCSHFTT_SHIFT31_POSN                    equ 0007h
CRCSHFTT_SHIFT31_POSITION                equ 0007h
CRCSHFTT_SHIFT31_SIZE                    equ 0001h
CRCSHFTT_SHIFT31_LENGTH                  equ 0001h
CRCSHFTT_SHIFT31_MASK                    equ 0080h

// Register: CRCXORT
#define CRCXORT CRCXORT
CRCXORT                                  equ 01CA1h
// bitfield definitions
CRCXORT_XOR_POSN                         equ 0000h
CRCXORT_XOR_POSITION                     equ 0000h
CRCXORT_XOR_SIZE                         equ 0008h
CRCXORT_XOR_LENGTH                       equ 0008h
CRCXORT_XOR_MASK                         equ 00FFh
CRCXORT_XOR24_POSN                       equ 0000h
CRCXORT_XOR24_POSITION                   equ 0000h
CRCXORT_XOR24_SIZE                       equ 0001h
CRCXORT_XOR24_LENGTH                     equ 0001h
CRCXORT_XOR24_MASK                       equ 0001h
CRCXORT_XOR25_POSN                       equ 0001h
CRCXORT_XOR25_POSITION                   equ 0001h
CRCXORT_XOR25_SIZE                       equ 0001h
CRCXORT_XOR25_LENGTH                     equ 0001h
CRCXORT_XOR25_MASK                       equ 0002h
CRCXORT_XOR26_POSN                       equ 0002h
CRCXORT_XOR26_POSITION                   equ 0002h
CRCXORT_XOR26_SIZE                       equ 0001h
CRCXORT_XOR26_LENGTH                     equ 0001h
CRCXORT_XOR26_MASK                       equ 0004h
CRCXORT_XOR27_POSN                       equ 0003h
CRCXORT_XOR27_POSITION                   equ 0003h
CRCXORT_XOR27_SIZE                       equ 0001h
CRCXORT_XOR27_LENGTH                     equ 0001h
CRCXORT_XOR27_MASK                       equ 0008h
CRCXORT_XOR28_POSN                       equ 0004h
CRCXORT_XOR28_POSITION                   equ 0004h
CRCXORT_XOR28_SIZE                       equ 0001h
CRCXORT_XOR28_LENGTH                     equ 0001h
CRCXORT_XOR28_MASK                       equ 0010h
CRCXORT_XOR29_POSN                       equ 0005h
CRCXORT_XOR29_POSITION                   equ 0005h
CRCXORT_XOR29_SIZE                       equ 0001h
CRCXORT_XOR29_LENGTH                     equ 0001h
CRCXORT_XOR29_MASK                       equ 0020h
CRCXORT_XOR30_POSN                       equ 0006h
CRCXORT_XOR30_POSITION                   equ 0006h
CRCXORT_XOR30_SIZE                       equ 0001h
CRCXORT_XOR30_LENGTH                     equ 0001h
CRCXORT_XOR30_MASK                       equ 0040h
CRCXORT_XOR31_POSN                       equ 0007h
CRCXORT_XOR31_POSITION                   equ 0007h
CRCXORT_XOR31_SIZE                       equ 0001h
CRCXORT_XOR31_LENGTH                     equ 0001h
CRCXORT_XOR31_MASK                       equ 0080h

// Register: CRCCON0
#define CRCCON0 CRCCON0
CRCCON0                                  equ 01CA2h
// bitfield definitions
CRCCON0_FULL_POSN                        equ 0000h
CRCCON0_FULL_POSITION                    equ 0000h
CRCCON0_FULL_SIZE                        equ 0001h
CRCCON0_FULL_LENGTH                      equ 0001h
CRCCON0_FULL_MASK                        equ 0001h
CRCCON0_SHIFTM_POSN                      equ 0001h
CRCCON0_SHIFTM_POSITION                  equ 0001h
CRCCON0_SHIFTM_SIZE                      equ 0001h
CRCCON0_SHIFTM_LENGTH                    equ 0001h
CRCCON0_SHIFTM_MASK                      equ 0002h
CRCCON0_SETUP_POSN                       equ 0002h
CRCCON0_SETUP_POSITION                   equ 0002h
CRCCON0_SETUP_SIZE                       equ 0002h
CRCCON0_SETUP_LENGTH                     equ 0002h
CRCCON0_SETUP_MASK                       equ 000Ch
CRCCON0_ACCMOD_POSN                      equ 0004h
CRCCON0_ACCMOD_POSITION                  equ 0004h
CRCCON0_ACCMOD_SIZE                      equ 0001h
CRCCON0_ACCMOD_LENGTH                    equ 0001h
CRCCON0_ACCMOD_MASK                      equ 0010h
CRCCON0_CRCBUSY_POSN                     equ 0005h
CRCCON0_CRCBUSY_POSITION                 equ 0005h
CRCCON0_CRCBUSY_SIZE                     equ 0001h
CRCCON0_CRCBUSY_LENGTH                   equ 0001h
CRCCON0_CRCBUSY_MASK                     equ 0020h
CRCCON0_CRCGO_POSN                       equ 0006h
CRCCON0_CRCGO_POSITION                   equ 0006h
CRCCON0_CRCGO_SIZE                       equ 0001h
CRCCON0_CRCGO_LENGTH                     equ 0001h
CRCCON0_CRCGO_MASK                       equ 0040h
CRCCON0_CRCEN_POSN                       equ 0007h
CRCCON0_CRCEN_POSITION                   equ 0007h
CRCCON0_CRCEN_SIZE                       equ 0001h
CRCCON0_CRCEN_LENGTH                     equ 0001h
CRCCON0_CRCEN_MASK                       equ 0080h
CRCCON0_LENDIAN_POSN                     equ 0001h
CRCCON0_LENDIAN_POSITION                 equ 0001h
CRCCON0_LENDIAN_SIZE                     equ 0001h
CRCCON0_LENDIAN_LENGTH                   equ 0001h
CRCCON0_LENDIAN_MASK                     equ 0002h
CRCCON0_SETUP0_POSN                      equ 0002h
CRCCON0_SETUP0_POSITION                  equ 0002h
CRCCON0_SETUP0_SIZE                      equ 0001h
CRCCON0_SETUP0_LENGTH                    equ 0001h
CRCCON0_SETUP0_MASK                      equ 0004h
CRCCON0_SETUP1_POSN                      equ 0003h
CRCCON0_SETUP1_POSITION                  equ 0003h
CRCCON0_SETUP1_SIZE                      equ 0001h
CRCCON0_SETUP1_LENGTH                    equ 0001h
CRCCON0_SETUP1_MASK                      equ 0008h
CRCCON0_ACCM_POSN                        equ 0004h
CRCCON0_ACCM_POSITION                    equ 0004h
CRCCON0_ACCM_SIZE                        equ 0001h
CRCCON0_ACCM_LENGTH                      equ 0001h
CRCCON0_ACCM_MASK                        equ 0010h
CRCCON0_BUSY_POSN                        equ 0005h
CRCCON0_BUSY_POSITION                    equ 0005h
CRCCON0_BUSY_SIZE                        equ 0001h
CRCCON0_BUSY_LENGTH                      equ 0001h
CRCCON0_BUSY_MASK                        equ 0020h
CRCCON0_GO_POSN                          equ 0006h
CRCCON0_GO_POSITION                      equ 0006h
CRCCON0_GO_SIZE                          equ 0001h
CRCCON0_GO_LENGTH                        equ 0001h
CRCCON0_GO_MASK                          equ 0040h
CRCCON0_EN_POSN                          equ 0007h
CRCCON0_EN_POSITION                      equ 0007h
CRCCON0_EN_SIZE                          equ 0001h
CRCCON0_EN_LENGTH                        equ 0001h
CRCCON0_EN_MASK                          equ 0080h

